<h1 style="color:blue; text-align:center">Intro to Pandas</h1>

pandas - a powerful data analysis and manipulation library for Python
=====================================================================

**pandas** is a Python package providing fast, flexible, and expressive data
structures designed to make working with "relational" or "labeled" data both
easy and intuitive. It aims to be the fundamental high-level building block for
doing practical, **real world** data analysis in Python. Additionally, it has
the broader goal of becoming **the most powerful and flexible open source data
analysis / manipulation tool available in any language**. It is already well on
its way toward this goal.

Main Features
-------------
Here are just a few of the things that pandas does well:

  - Easy handling of missing data in floating point as well as non-floating
    point data
  - Size mutability: columns can be inserted and deleted from DataFrame and
    higher dimensional objects
  - Automatic and explicit data alignment: objects can  be explicitly aligned
    to a set of labels, or the user can simply ignore the labels and let
    `Series`, `DataFrame`, etc. automatically align the data for you in
    computations
  - Powerful, flexible group by functionality to perform split-apply-combine
    operations on data sets, for both aggregating and transforming data
  - Make it easy to convert ragged, differently-indexed data in other Python
    and NumPy data structures into DataFrame objects
  - Intelligent label-based slicing, fancy indexing, and subsetting of large
    data sets
  - Intuitive merging and joining data sets
  - Flexible reshaping and pivoting of data sets
  - Hierarchical labeling of axes (possible to have multiple labels per tick)
  - Robust IO tools for loading data from flat files (CSV and delimited),
    Excel files, databases, and saving/loading data from the ultrafast HDF5
    format
  - Time series-specific functionality: date range generation and frequency
    conversion, moving window statistics, moving window linear regressions,
    date shifting and lagging, etc.
    
Source: official documentation
[run command: pd?]

### Import the package

In [1]:
import pandas as pd
import numpy as np

In [2]:
# check your version
print(pd.__version__)

0.22.0+0.ga00154d.dirty

### Two main data structures
### 1. Series
### 2. DataFrame

### Series
- Similar to 1-d numpy array but with more flexible explicit indexing
- Has two components : index and value for each element
- A bit similar concept as dictionary
- <a href='https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.html'> more here..</a>

#### create a series object

In [3]:
np.random.random(5)

array([0.90942281, 0.61230182, 0.31859751, 0.37995384, 0.24453894])

In [4]:
series1  = pd.Series(np.random.random(5))
series1

0    0.019892
1    0.962033
2    0.031545
3    0.602173
4    0.928073
dtype: float64

In [5]:
pd.Series(2, index=np.arange(1,10))

1    2
2    2
3    2
4    2
5    2
6    2
7    2
8    2
9    2
dtype: int64

In [6]:
# from a dictionary
dict1 = {'a' : 123, 'b' : [1,2,'p']}
pd.Series(dict1)

a          123
b    [1, 2, p]
dtype: object

#### Get values or indices
- use series.values
- use series.index
- Note: it's not a function call with ()

In [7]:
series1.values

array([0.01989209, 0.96203269, 0.03154471, 0.60217346, 0.92807262])

In [8]:
series1.index

RangeIndex(start=0, stop=5, step=1)

#### Change the indexes

In [ ]:
# shift it by 1
series1.index += 1
series1

In [ ]:
# indices may be noncontiguous
series1.index = series1.index**2

In [ ]:
series1

#### Accessing elements works similar to numpy

In [ ]:
series1[1]

In [ ]:
series1[2] # key error

In [ ]:
series1 = series1.reset_index(drop=True) 
# also try without drop = Ture

<a href='https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.reset_index.html'>more here..</a>

In [ ]:
series1

In [ ]:
series1[2]

#### Some common opertaions

In [ ]:
# comparisons with a scalar
series1 > 0.5

In [ ]:
# accessing values 
series1[series1 > .2]

In [ ]:
series1**2

In [ ]:
series1

In [ ]:
series2 = pd.Series(np.random.randint(1,10,5))
series2

In [ ]:
# check for a value
5 in series2.values

In [ ]:
# get indices
series2[series2 == 5]

In [ ]:
series2[(series2 >= 4) & (series2 < 8)]

### loc, iloc

- loc : indexing & slicing with expicit index. Retuns rows (or columns) with particular labels from the index
- iloc : only integer based; indexing & slicing with implicit index.

In [ ]:
indices = [4,2,5,8]

In [ ]:
series3 = pd.Series(np.arange(1,5), index = indices)
series3

In [ ]:
# loc
series3.loc[5]

In [ ]:
# iloc
series3.iloc[2]

In [ ]:
series3.iloc[1:4]

In [ ]:
series3

In [ ]:
series3.iloc[0:5] # going beyong available indices

#### index alignmnet

In [ ]:
series3

In [ ]:
indices = [4,5,2,5,9]
series4 = pd.Series(np.arange(1, 6), index = indices)
series4

In [ ]:
# while adding pandas will take into account indices at different locations
s = series3 + series4
s

In [ ]:
k = s[s <> np.nan]
k

In [ ]:
kk = s.dropna()
kk

In [ ]:
s

In [ ]:
s.dropna(inplace= True)
s

In [ ]:
s1 = pd.Series({'A1': 100, 'A2': 234, 'A3': 111})
s2 = pd.Series({'A1': 20000, 'A4': 32000, 'A3': 12000})

In [ ]:
s1/s2

In [ ]:
out_series = series4 + series3
out_series

In [ ]:
# check for nulls
pd.isnull(out_series)

### DataFrame

- **pd.DataFrame(self, data=None, index=None, columns=None, dtype=None, copy=False)**

    
- The primary pandas data structure
- Tabular format similar to excel
- Two-dimensional, potentially heterogeneous tabular data
- structure with labeled axes (rows and columns). Row and columns index
- Can be thought of as a dict-like container for Series objects.

#### create a dataframe

In [ ]:
df = pd.DataFrame(np.random.rand(10, 5))
df

In [ ]:
df.columns.values

In [ ]:
df.values

In [ ]:
df.index

In [ ]:
print df.ndim

In [ ]:
df.dtypes

In [ ]:
df.shape

In [ ]:
df.describe()

In [ ]:
df.mean()

In [ ]:
# transpose
df.T

In [ ]:
df

In [ ]:
# stack
df_stacked = df.stack()

print type(df_stacked)

df_stacked

In [ ]:
print type(df_stacked.unstack())

df_stacked.unstack()

In [ ]:
# stack and compute mean
df.stack().mean()

In [ ]:
df.mean() # rows or columns ?

In [ ]:
df.mean(0)

In [ ]:
df.mean(axis=1)

In [ ]:
# check
df[0].mean()

In [ ]:
# explicit column names
pd.DataFrame(np.random.randn(10, 5),columns=['a', 'b', 'c', 'd', 'e'])

In [ ]:
pd.DataFrame(np.random.randn(10, 5),columns=list('abcde'))

In [ ]:
d = {'col1': [1,2,3,4], 'col2': [3,2,1,None], 'col3': ['a',1,2,None]}
df = pd.DataFrame(data=d)
df

In [ ]:
print type(df['col2'])

print type(df.col3)

In [ ]:
df = pd.DataFrame([{'col1': 1, 'col2': 2}, {'col3': 3, 'col2': 4}])
df

In [ ]:
# Access values
df['col1']

In [ ]:
df.col2

In [ ]:
df.col3

In [ ]:
# create new column
df['col4'] = [1,2] # in place
df

In [342]:
df['col4'] = pd.Series([1,2])
df

   col1  col2  col3  col4
0     1   3.0     a   1.0
1     2   2.0     1   2.0
2     3   1.0     2   NaN
3     4   NaN  None   NaN

### loc, iloc

In [343]:
df = pd.DataFrame(np.random.randn(10, 5),columns=['a', 'b', 'c', 'd', 'e'])
df

          a         b         c         d         e
0  0.516473  0.712049  0.800316 -0.609473 -1.314787
1 -1.088961  1.353876 -1.432093  0.960988  2.402081
2 -1.195315 -0.652945 -0.332465  0.403533  0.751770
3 -0.009451  0.630507 -0.279947 -0.755564  2.017900
4  0.354235 -1.199732 -0.059456  0.494536 -0.182226
5 -3.012797  1.298652 -0.729900 -0.985227  0.665174
6 -0.830001  0.287827 -1.427582  0.578886 -0.125695
7  1.045648  0.661727  0.384605  0.872420  0.008752
8 -0.197470  0.574145 -0.793733  0.774352 -0.868312
9  0.846334  0.329341 -0.592874 -1.324040 -0.659564

In [344]:
df.loc[1:4]

          a         b         c         d         e
1 -1.088961  1.353876 -1.432093  0.960988  2.402081
2 -1.195315 -0.652945 -0.332465  0.403533  0.751770
3 -0.009451  0.630507 -0.279947 -0.755564  2.017900
4  0.354235 -1.199732 -0.059456  0.494536 -0.182226

In [345]:
df.loc[:,:'c'] # df.loc[row_indices, col_indices]

          a         b         c
0  0.516473  0.712049  0.800316
1 -1.088961  1.353876 -1.432093
2 -1.195315 -0.652945 -0.332465
3 -0.009451  0.630507 -0.279947
4  0.354235 -1.199732 -0.059456
5 -3.012797  1.298652 -0.729900
6 -0.830001  0.287827 -1.427582
7  1.045648  0.661727  0.384605
8 -0.197470  0.574145 -0.793733
9  0.846334  0.329341 -0.592874

In [346]:
df.loc[2:6,:]

          a         b         c         d         e
2 -1.195315 -0.652945 -0.332465  0.403533  0.751770
3 -0.009451  0.630507 -0.279947 -0.755564  2.017900
4  0.354235 -1.199732 -0.059456  0.494536 -0.182226
5 -3.012797  1.298652 -0.729900 -0.985227  0.665174
6 -0.830001  0.287827 -1.427582  0.578886 -0.125695

In [347]:
df.loc[:6,:'c'] #

          a         b         c
0  0.516473  0.712049  0.800316
1 -1.088961  1.353876 -1.432093
2 -1.195315 -0.652945 -0.332465
3 -0.009451  0.630507 -0.279947
4  0.354235 -1.199732 -0.059456
5 -3.012797  1.298652 -0.729900
6 -0.830001  0.287827 -1.427582

In [348]:
# iloc
df.iloc[:4,:4] # rows till index n-1 and columns till index n-1

          a         b         c         d
0  0.516473  0.712049  0.800316 -0.609473
1 -1.088961  1.353876 -1.432093  0.960988
2 -1.195315 -0.652945 -0.332465  0.403533
3 -0.009451  0.630507 -0.279947 -0.755564

In [ ]:
df[1:4] # row wise slicing not columns

In [351]:
df.loc['a':'c'] # try this error

Empty DataFrame
Columns: [a, b, c, d, e]
Index: []

In [352]:
# using conditions
df.loc[df['a'] > 0]

          a         b         c         d         e
0  0.516473  0.712049  0.800316 -0.609473 -1.314787
4  0.354235 -1.199732 -0.059456  0.494536 -0.182226
7  1.045648  0.661727  0.384605  0.872420  0.008752
9  0.846334  0.329341 -0.592874 -1.324040 -0.659564

In [353]:
df.loc[df['a'] > 0, 'b':'d']

          b         c         d
0  0.712049  0.800316 -0.609473
4 -1.199732 -0.059456  0.494536
7  0.661727  0.384605  0.872420
9  0.329341 -0.592874 -1.324040

In [354]:
df = pd.DataFrame(np.random.randint(1,5,size=(4,5)),columns=['a', 'b', 'c', 'd', 'e'])
df

   a  b  c  d  e
0  4  3  3  3  2
1  3  2  3  3  4
2  4  2  3  2  2
3  2  3  4  1  1

In [355]:
df.add(df)

   a  b  c  d  e
0  8  6  6  6  4
1  6  4  6  6  8
2  8  4  6  4  4
3  4  6  8  2  2

In [356]:
df['a']

0    4
1    3
2    4
3    2
Name: a, dtype: int32

In [357]:
df

   a  b  c  d  e
0  4  3  3  3  2
1  3  2  3  3  4
2  4  2  3  2  2
3  2  3  4  1  1

In [358]:
df.subtract(df['a'], axis=0)

   a  b  c  d  e
0  0 -1 -1 -1 -2
1  0 -1  0  0  1
2  0 -2 -1 -2 -2
3  0  1  2 -1 -1

In [359]:
df.iloc[0]

a    4
b    3
c    3
d    3
e    2
Name: 0, dtype: int32

In [360]:
df - df.iloc[0] # row wise if axis is not defined

   a  b  c  d  e
0  0  0  0  0  0
1 -1 -1  0  0  2
2  0 -1  0 -1  0
3 -2  0  1 -2 -1

### missing data
- NaN : special floating point value; np.nan

In [361]:
arr = np.array([1,2,3,None]) # dtype is object
arr

array([1, 2, 3, None], dtype=object)

In [362]:
arr2 = np.array(arr, dtype=np.float)
arr2

array([  1.,   2.,   3.,  nan])

In [363]:
arr # unchanged

array([1, 2, 3, None], dtype=object)

In [364]:
arr = np.array([1,2,3,np.nan])
arr.dtype

dtype('float64')

In [365]:
arr + 1

array([  2.,   3.,   4.,  nan])

In [366]:
arr * 0

array([  0.,   0.,   0.,  nan])

In [367]:
# pandas handles None and NaN
# changes as needed
# dtype is object
pd.Series([ 'a', np.nan, 'b', None, 'c'])

0       a
1     NaN
2       b
3    None
4       c
dtype: object

In [368]:
ss = pd.Series([ 1, np.nan, 2, None, 3]) 
ss
# all are numbers so dtype = float

0    1.0
1    NaN
2    2.0
3    NaN
4    3.0
dtype: float64

- When summing data, NA (missing) values will be treated as zero
- If the data are all NA, the result will be NA
- Methods like cumsum and cumprod ignore NA values, but preserve them in the resulting arrays

In [ ]:
ss.sum()

#### drop & fill

In [369]:
ss.dropna() # for series object

0    1.0
2    2.0
4    3.0
dtype: float64

In [370]:
ss

0    1.0
1    NaN
2    2.0
3    NaN
4    3.0
dtype: float64

In [371]:
df = pd.DataFrame([[1,None,3],
                 [2,np.nan,4,3],
                 [1,2,6,np.nan],
                  [1,1,1,1,np.nan]])
df

   0    1  2    3   4
0  1  NaN  3  NaN NaN
1  2  NaN  4  3.0 NaN
2  1  2.0  6  NaN NaN
3  1  1.0  1  1.0 NaN

In [372]:
df.describe()

          0         1         2         3    4
count  4.00  2.000000  4.000000  2.000000  0.0
mean   1.25  1.500000  3.500000  2.000000  NaN
std    0.50  0.707107  2.081666  1.414214  NaN
min    1.00  1.000000  1.000000  1.000000  NaN
25%    1.00  1.250000  2.500000  1.500000  NaN
50%    1.00  1.500000  3.500000  2.000000  NaN
75%    1.25  1.750000  4.500000  2.500000  NaN
max    2.00  2.000000  6.000000  3.000000  NaN

In [373]:
df

   0    1  2    3   4
0  1  NaN  3  NaN NaN
1  2  NaN  4  3.0 NaN
2  1  2.0  6  NaN NaN
3  1  1.0  1  1.0 NaN

In [374]:
df.dropna()

Empty DataFrame
Columns: [0, 1, 2, 3, 4]
Index: []

In [375]:
df

   0    1  2    3   4
0  1  NaN  3  NaN NaN
1  2  NaN  4  3.0 NaN
2  1  2.0  6  NaN NaN
3  1  1.0  1  1.0 NaN

In [376]:
df.dropna(axis=1)

   0  2
0  1  3
1  2  4
2  1  6
3  1  1

In [377]:
# drop only if all are NaN
df.dropna(axis=1, how = 'all')

   0    1  2    3
0  1  NaN  3  NaN
1  2  NaN  4  3.0
2  1  2.0  6  NaN
3  1  1.0  1  1.0

In [378]:
# fill NaN
df.fillna(0)

   0    1  2    3    4
0  1  0.0  3  0.0  0.0
1  2  0.0  4  3.0  0.0
2  1  2.0  6  0.0  0.0
3  1  1.0  1  1.0  0.0

In [379]:
# fill with column level statistics
df.fillna(df.mean())

   0    1  2    3   4
0  1  1.5  3  2.0 NaN
1  2  1.5  4  3.0 NaN
2  1  2.0  6  2.0 NaN
3  1  1.0  1  1.0 NaN

In [380]:
df # not in place

   0    1  2    3   4
0  1  NaN  3  NaN NaN
1  2  NaN  4  3.0 NaN
2  1  2.0  6  NaN NaN
3  1  1.0  1  1.0 NaN

In [381]:
# forward fill using method
df.fillna(method='ffill')

   0    1  2    3   4
0  1  NaN  3  NaN NaN
1  2  NaN  4  3.0 NaN
2  1  2.0  6  3.0 NaN
3  1  1.0  1  1.0 NaN

In [382]:
# forward fill using method
df.fillna(method='ffill', axis = 1)

     0    1    2    3    4
0  1.0  1.0  3.0  3.0  3.0
1  2.0  2.0  4.0  3.0  3.0
2  1.0  2.0  6.0  6.0  6.0
3  1.0  1.0  1.0  1.0  1.0

In [384]:
df

   0    1  2    3   4
0  1  NaN  3  NaN NaN
1  2  NaN  4  3.0 NaN
2  1  2.0  6  NaN NaN
3  1  1.0  1  1.0 NaN

In [383]:
# forward fill using method
df.fillna(method='bfill')

   0    1  2    3   4
0  1  2.0  3  3.0 NaN
1  2  2.0  4  3.0 NaN
2  1  2.0  6  1.0 NaN
3  1  1.0  1  1.0 NaN

In [385]:
# datetime
s = '05SEP2014:00:00:00.000'
type(s)

str

In [386]:
pd.to_datetime(s, format='%d%b%Y:%H:%M:%S.%f')

Timestamp('2014-09-05 00:00:00')

<a href='https://pandas.pydata.org/pandas-docs/stable/generated/pandas.to_datetime.html'>more here..</a>

<a href='http://strftime.org/'>time formats</a>

### example -1

In [ ]:
import os

In [389]:
path = r'D:\work\courses\MLDS\prakash\D3\data'
dataset = pd.read_csv(os.path.join(path, 'iris.csv'))

In [390]:
dataset.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [391]:
dataset.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [392]:
# Fill empty frames
training_dataset = pd.DataFrame()
test_dataset = pd.DataFrame()

In [393]:
setosa = dataset.loc[dataset.species=="setosa",:]
versicolor = dataset.loc[dataset.species=="versicolor",:]
virginica = dataset.loc[dataset.species=="virginica",:]

setosa = setosa.reset_index(drop=True) # drop = True if you don't want it saved as a column,
versicolor = versicolor.reset_index(drop=True)
virginica = virginica.reset_index(drop=True)

In [394]:
virginica.head()

   sepal_length  sepal_width  petal_length  petal_width    species
0           6.3          3.3           6.0          2.5  virginica
1           5.8          2.7           5.1          1.9  virginica
2           7.1          3.0           5.9          2.1  virginica
3           6.3          2.9           5.6          1.8  virginica
4           6.5          3.0           5.8          2.2  virginica

In [396]:
training_dataset = training_dataset.append(setosa.loc[:39,:])
training_dataset = training_dataset.append(versicolor.loc[:39,:])
training_dataset = training_dataset.append(virginica.loc[:39,:])

In [397]:
training_dataset.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [398]:
training_dataset = training_dataset.reset_index(drop=True)
training_dataset.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [399]:
training_dataset.describe()

       sepal_length  sepal_width  petal_length  petal_width
count     120.00000   120.000000    120.000000   120.000000
mean        5.89000     3.060000      3.795833     1.190833
std         0.84589     0.441807      1.792861     0.757372
min         4.30000     2.000000      1.000000     0.100000
25%         5.17500     2.800000      1.575000     0.300000
50%         5.80000     3.000000      4.450000     1.400000
75%         6.40000     3.325000      5.100000     1.800000
max         7.90000     4.400000      6.900000     2.500000

In [ ]:
test_dataset = test_dataset.append(setosa.loc[40:,:])
test_dataset = test_dataset.append(versicolor.loc[40:,:])
test_dataset = test_dataset.append(virginica.loc[40:,:])

In [ ]:
test_dataset = test_dataset.reset_index(drop=True)

In [ ]:
test_dataset.head()

In [ ]:
import matplotlib.pyplot as plt

In [ ]:
%matplotlib inline
plt.scatter(list(range(len(training_dataset[training_dataset.species=="setosa"].index))),training_dataset[training_dataset.species=="setosa"].petal_length, color = 'green', label = "setosa PL")
plt.scatter(list(range(len(training_dataset[training_dataset.species=="virginica"].index))),training_dataset[training_dataset.species=="virginica"].petal_length, color = 'red', label = "virginica PL")
plt.scatter(list(range(len(training_dataset[training_dataset.species=="versicolor"].index))),training_dataset[training_dataset.species=="versicolor"].petal_length, color = 'yellow', label = "versicolor PL")
plt.legend()
plt.show()

### example -2

In [ ]:
import os

In [ ]:
path = r'D:\work\courses\MLDS\prakash\D3\data'
dataset = pd.read_excel(os.path.join(path,'BreastTissue.xls'),'Data') # sheet name
dataset.head()

In [ ]:
dataset.describe()

In [ ]:
dataset.hist(figsize=(10, 10))
plt.show()

In [ ]:
# unique classes
print dataset.Class.unique()

In [ ]:
# total unique classes
print dataset.Class.nunique()

In [ ]:
# count of each class
for name in dataset.Class.unique():
    print name, dataset.loc[dataset.Class==name,"Class"].count()

In [ ]:
dataset.drop(dataset.columns[0],inplace=True,axis=1)
dataset.head()

In [ ]:
dataset.boxplot(figsize=(6,6))
plt.show()

In [ ]:
print dataset.columns.values[1:]

In [ ]:
for name in dataset.columns.values[1:]:
    Q1 = dataset[name].quantile(0.25)
    Q3 = dataset[name].quantile(0.75)
    IQR = Q3 - Q1
    mask = (dataset[name] < (Q1 - 1.5 * IQR)) | (dataset[name] > (Q3 + 1.5 * IQR)) # suspected outlier
    
    dataset.loc[mask,[name]] = np.nan

In [ ]:
dataset.describe()

In [ ]:
dataset.hist(figsize=(10, 10))
plt.show()

In [ ]:
plt.cla()
# cla()   # Clear axis
# clf()   # Clear figure
# close() # Close a figure window
dataset.boxplot(figsize=(6, 6))
plt.show()

In [ ]:
dataset.isnull().sum()

### Interpolation of data

- Linear interpolation is often used to fill the gaps in a table. Suppose that one has a table listing the population of some country in 1970, 1980, 1990 and 2000, and that one wanted to estimate the population in 1994. Linear interpolation is an easy way to do this..wikipedia
- Linear interpolation has been used since antiquity for filling the gaps in tables, often with astronomical data..wikipedia

In [ ]:
dataset = dataset.interpolate()

In [ ]:
dataset.isnull().sum()

In [ ]:
dataset.describe()

In [ ]:
dataset.hist(figsize=(10, 10))
plt.show()

#### References

1. https://pandas.pydata.org/pandas-docs/stable/  
2. Python Data Science Handbook by Jake VanderPlas
3. Python for Data Analysis: Data Wrangling with Pandas, NumPy, and IPython by Wes McKinney